Hi Guys,<br>
Welcome back to the pandas essentials, now we are going to talk about the missing data!<br>
## Handling Missing Data
Missing data is very common in many data analysis applications. pandas has a great ability to deal with the missing data. <br>Let's learn some convenient methods to deal with **missing data in pandas**:<br>

* isnull(), isna(), notnull(), dropna(), fillna(),

In [1]:
import numpy as np
import pandas as pd

Creating ad dataframe with missing data

In [2]:
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.

In [3]:
df

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN   NaN
2  NaN  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0


**Check for missing data in the dataset!**

In [4]:
#code here

In [5]:
missing_data = df.isna()
missing_data

       M      N     O      P
0  False  False  True  False
1  False  False  True   True
2   True  False  True  False
3  False  False  True  False
4   True  False  True  False

In [6]:
#code here

In [7]:
#code here

**fill the null value with N**

In [8]:
#code here

In [9]:
df_filled = df.fillna('N')
df_filled

     M   N  O     P
0  1.0  11  N  16.0
1  2.0  12  N     N
2    N  13  N  18.0
3  4.0  14  N  19.0
4    N  15  N  20.0

**fill the null values using mean of the column M.**

In [10]:
#code here

In [11]:
mean_M = df['M'].mean()
df['M'] = df['M'].fillna(mean_M)
df['M']

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: M, dtype: float64

In [12]:
df

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN   NaN
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

Forward fill

In [13]:
#code here

**Make this dataframe using Dictionary**

In [14]:
#code here

In [15]:
data_dic = {'M': [1, 2, np.nan, 4, np.nan],
            'N': [11, 12, 13, 14, 15],
            'O': [np.nan, np.nan, np.nan, np.nan, np.nan],
            'P': [16, np.nan, 18, 19, 20]}

df1 = pd.DataFrame(data_dic)

In [16]:
df1

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN   NaN
2  NaN  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0